In [67]:
import pandas as pd
import numpy as np

In [68]:
labels = ('vardas', 'pavardė', 'amžius')
zmogus = ('Geras', 'Zmogelis', 33)
print(labels, zmogus)

('vardas', 'pavardė', 'amžius') ('Geras', 'Zmogelis', 33)

In [69]:
pd.Series(data=zmogus)

0       Geras
1    Zmogelis
2          33
dtype: object

In [70]:
pd.Series(data=zmogus, index=labels)

vardas        Geras
pavardė    Zmogelis
amžius           33
dtype: object

In [71]:
zmogus_dict = {
    'vardas': 'Smagus',
    'pavarde': 'Giedriukas',
    'amzius': 36
}
zmogus_dict

{'vardas': 'Smagus', 'pavarde': 'Giedriukas', 'amzius': 36}

In [72]:
zmogus_pd = pd.Series(zmogus_dict)
zmogus_pd

vardas         Smagus
pavarde    Giedriukas
amzius             36
dtype: object

In [73]:
pd.Series(zmogus, labels)

vardas        Geras
pavardė    Zmogelis
amžius           33
dtype: object

In [74]:
zmogus_pd['amzius']

36

In [75]:
miestai = pd.Series((500, 400, 300, 200), ('Vilnius', 'Kaunas', 'Klaipeda', 'Siauliai'))
miestai

Vilnius     500
Kaunas      400
Klaipeda    300
Siauliai    200
dtype: int64

In [76]:
augimas = pd.Series((1.5, 1.3, 0.9, 0.7), ('Vilnius', 'Kaunas', 'Klaipeda', 'Siauliai'))
augimas

Vilnius     1.5
Kaunas      1.3
Klaipeda    0.9
Siauliai    0.7
dtype: float64

In [77]:
miestai * augimas

Vilnius     750.0
Kaunas      520.0
Klaipeda    270.0
Siauliai    140.0
dtype: float64

In [78]:
betko7x7 = np.random.randint(10, 100, (7, 7))
betko7x7

array([[62, 90, 15, 15, 97, 54, 17],
       [30, 96, 43, 83, 36, 28, 16],
       [20, 23, 82, 65, 69, 26, 60],
       [22, 19, 91, 86, 80, 34, 79],
       [71, 72, 86, 13, 10, 14, 22],
       [90, 17, 25, 81, 70, 44, 77],
       [57, 23, 49, 44, 38, 29, 94]])

In [79]:
miestu_skaiciai = pd.DataFrame(
    betko7x7,
    [2000, 2004, 2008, 2012, 2016, 2020, 2024],
    ['Vilnius', 'Kaunas', 'Klaipeda', 'Siauliai', 'Panevezys', 'Alytus', 'Druskininkai']
)
miestu_skaiciai

      Vilnius  Kaunas  Klaipeda  Siauliai  Panevezys  Alytus  Druskininkai
2000       62      90        15        15         97      54            17
2004       30      96        43        83         36      28            16
2008       20      23        82        65         69      26            60
2012       22      19        91        86         80      34            79
2016       71      72        86        13         10      14            22
2020       90      17        25        81         70      44            77
2024       57      23        49        44         38      29            94

In [80]:
miestu_skaiciai['Klaipeda']

2000    15
2004    43
2008    82
2012    91
2016    86
2020    25
2024    49
Name: Klaipeda, dtype: int64

In [81]:
print(type(miestu_skaiciai['Klaipeda']))
print(type(miestu_skaiciai))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [82]:
miestu_skaiciai[['Vilnius', 'Alytus', 'Druskininkai']]

      Vilnius  Alytus  Druskininkai
2000       62      54            17
2004       30      28            16
2008       20      26            60
2012       22      34            79
2016       71      14            22
2020       90      44            77
2024       57      29            94

In [83]:
miestu_skaiciai['Vilnius'][2000] = 99
miestu_skaiciai['Vilnius'][2000]

99

In [84]:
miestu_skaiciai.loc[2012]

Vilnius         22
Kaunas          19
Klaipeda        91
Siauliai        86
Panevezys       80
Alytus          34
Druskininkai    79
Name: 2012, dtype: int64

In [85]:
kazluruda = pd.Series(np.random.randint(10, 99, 7), np.arange(2000, 2025, 4))
kazluruda

2000    65
2004    20
2008    34
2012    88
2016    22
2020    69
2024    90
dtype: int64

In [86]:
miestu_skaiciai['Kazlu Ruda'] = kazluruda
miestu_skaiciai

,Vilnius,Kaunas,Klaipeda,Siauliai,Panevezys,Alytus,Druskininkai,Kazlu Ruda
2000,99,90,15,15,97,54,17,65
2004,30,96,43,83,36,28,16,20
2008,20,23,82,65,69,26,60,34
2012,22,19,91,86,80,34,79,88
2016,71,72,86,13,10,14,22,22
2020,90,17,25,81,70,44,77,69
2024,57,23,49,44,38,29,94,90

In [87]:
miestu_skaiciai.drop('Siauliai', axis=1, inplace=True)

In [88]:
miestu_skaiciai

      Vilnius  Kaunas  Klaipeda  Panevezys  Alytus  Druskininkai  Kazlu Ruda
2000       99      90        15         97      54            17          65
2004       30      96        43         36      28            16          20
2008       20      23        82         69      26            60          34
2012       22      19        91         80      34            79          88
2016       71      72        86         10      14            22          22
2020       90      17        25         70      44            77          69
2024       57      23        49         38      29            94          90

In [92]:
miestai_be_2008 = miestu_skaiciai.drop(2008)
miestai_be_2008

      Vilnius  Kaunas  Klaipeda  Panevezys  Alytus  Druskininkai  Kazlu Ruda
2000       99      90        15         97      54            17          65
2004       30      96        43         36      28            16          20
2012       22      19        91         80      34            79          88
2016       71      72        86         10      14            22          22
2020       90      17        25         70      44            77          69
2024       57      23        49         38      29            94          90

In [93]:
miestu_skaiciai.loc[2008]

Vilnius         20
Kaunas          23
Klaipeda        82
Panevezys       69
Alytus          26
Druskininkai    60
Kazlu Ruda      34
Name: 2008, dtype: int64

In [94]:
miestu_skaiciai.iloc[3]

Vilnius         22
Kaunas          19
Klaipeda        91
Panevezys       80
Alytus          34
Druskininkai    79
Kazlu Ruda      88
Name: 2012, dtype: int64

In [98]:
miestu_skaiciai['Vilnius'][2020]

90

In [96]:
miestu_skaiciai.loc[2020, 'Vilnius']

90

In [100]:
miestu_skaiciai.loc[[2012, 2020, 2024], ['Kaunas', 'Alytus']]

      Kaunas  Alytus
2012      19      34
2020      17      44
2024      23      29

In [109]:
miestu_skaiciai[['Kaunas', 'Alytus']].loc[[2020, 2012, 2000]]

      Kaunas  Alytus
2020      17      44
2012      19      34
2000      90      54

In [110]:
miestu_skaiciai[miestu_skaiciai > 70]

      Vilnius  Kaunas  Klaipeda  Panevezys  Alytus  Druskininkai  Kazlu Ruda
2000     99.0    90.0       NaN       97.0     NaN           NaN         NaN
2004      NaN    96.0       NaN        NaN     NaN           NaN         NaN
2008      NaN     NaN      82.0        NaN     NaN           NaN         NaN
2012      NaN     NaN      91.0       80.0     NaN          79.0        88.0
2016     71.0    72.0      86.0        NaN     NaN           NaN         NaN
2020     90.0     NaN       NaN        NaN     NaN          77.0         NaN
2024      NaN     NaN       NaN        NaN     NaN          94.0        90.0

In [113]:
print(miestu_skaiciai[miestu_skaiciai['Klaipeda'] > 50])

      Vilnius  Kaunas  Klaipeda  Panevezys  Alytus  Druskininkai  Kazlu Ruda
2008       20      23        82         69      26            60          34
2012       22      19        91         80      34            79          88
2016       71      72        86         10      14            22          22

In [115]:
miestu_skaiciai[miestu_skaiciai['Klaipeda'] > 80][['Vilnius', 'Klaipeda']]

      Vilnius  Klaipeda
2008       20        82
2012       22        91
2016       71        86

In [118]:
miestu_skaiciai[(miestu_skaiciai['Vilnius'] > 90) | (miestu_skaiciai['Klaipeda'] > 80)]

      Vilnius  Kaunas  Klaipeda  Panevezys  Alytus  Druskininkai  Kazlu Ruda
2000       99      90        15         97      54            17          65
2008       20      23        82         69      26            60          34
2012       22      19        91         80      34            79          88
2016       71      72        86         10      14            22          22

In [119]:
miestu_skaiciai.reset_index()

,index,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda
0,2000,99,90,15,97,54,17,65
1,2004,30,96,43,36,28,16,20
2,2008,20,23,82,69,26,60,34
3,2012,22,19,91,80,34,79,88
4,2016,71,72,86,10,14,22,22
5,2020,90,17,25,70,44,77,69
6,2024,57,23,49,38,29,94,90

In [122]:
be_indekso = miestu_skaiciai.reset_index()
be_indekso

,index,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda
0,2000,99,90,15,97,54,17,65
1,2004,30,96,43,36,28,16,20
2,2008,20,23,82,69,26,60,34
3,2012,22,19,91,80,34,79,88
4,2016,71,72,86,10,14,22,22
5,2020,90,17,25,70,44,77,69
6,2024,57,23,49,38,29,94,90

In [123]:
be_indekso['Utena'] = np.random.randint(10, 71, 7)
be_indekso

,index,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda,Utena
0,2000,99,90,15,97,54,17,65,28
1,2004,30,96,43,36,28,16,20,14
2,2008,20,23,82,69,26,60,34,37
3,2012,22,19,91,80,34,79,88,34
4,2016,71,72,86,10,14,22,22,53
5,2020,90,17,25,70,44,77,69,37
6,2024,57,23,49,38,29,94,90,12

In [125]:
su_utena = be_indekso.set_index('index')
su_utena

,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda,Utena
index,,,,,,,,
2000,99,90,15,97,54,17,65,28
2004,30,96,43,36,28,16,20,14
2008,20,23,82,69,26,60,34,37
2012,22,19,91,80,34,79,88,34
2016,71,72,86,10,14,22,22,53
2020,90,17,25,70,44,77,69,37
2024,57,23,49,38,29,94,90,12